porousVent/benchmark_schmidtModel/schmidtModel_config03/system/refineMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      refineMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

set             floorvent;

coordinateSystem global;

globalCoeffs
{
    tan1            ( 1 0 0 );
    tan2 	    ( 0 1 0 );

}

directions      
(	
	normal
	
);

useHexTopology  yes;

geometricCut    no;

writeMesh       no;

// ************************************************************************* //
